<template>
  <!-- 第一个 停电检测 -->
  <div>
    <dv-scroll-board
                  :config="table"
                  style="width: 100%; height: 24vh;"
                />
  </div>
</template>

<script setup lang="ts">
import { defineProps, ref } from 'vue';
const table = ref();

// 示例数据
table.value = {
  headerHeight: 50,
  headerBGC:'rgba(14,183,221,0.8)',
  oddRowBGC:'rgba(14,183,221,0.3)',
  evenRowBGC:'rgba(14,183,221,0.4)',
  header: [
    "隐患编号",
    "项目编码",
    "分部名称",
    "分项名称",
    "隐患级别",
    "隐患类型",
    "说明",
  ],
  data: [
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    {
      隐患编号: "WT20231011",
      项目编码: "XM0015562",
      分部名称: "主体结构",
      分项名称: "混泥土结构",
      隐患级别: "一般",
      隐患类型: "施工问题",
      说明: "边角未休整",
    },
    // ...其他数据行
  ],
};
</script>